# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Revisão Aula 17
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS:   H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |
* (#2) Testes com o exemplo de video

#+BEGIN_EXPORT latex
$$
\begin{bmatrix}
3.0000 & 1.0000 & 1.0000 &  1.0000 \\
0.0000 & 1.6667 & 0.6667 &  1.6667 \\
0.0000 & 0.0000 & 0.4000 &  0.0000 \\
0.0000 & 0.0000 & 0.0000 & -1.0001 \\
\end{bmatrix}
\begin{bmatrix}
x_1 \\
x_2 \\
x_3 \\
x_4
\end{bmatrix}
=
\begin{bmatrix}
6.0000 \\
4.0002 \\
0.4001 \\
-1.0003
\end{bmatrix}
#+END_EXPORT

Automatizando a entrada dos dados em /bash/ (terminal do Linux)

#+begin_src bash :results output :session :exports both
gcc rev-a17-sistema.c
echo "4 3 1 1 1 6 1.6667 0.6667 1.6667 4.0002 0.4000 0 0.4001 -1.0001 -1.0003" | ./a.out
#+END_SRC

#+RESULTS:
: Entre o tamanho (n) do sistema (n <= 5): Coeficiente a(1,1): Coeficiente a(1,2): Coeficiente a(1,3): Coeficiente a(1,4): Termo independente b(1): Coeficiente a(2,2): Coeficiente a(2,3): Coeficiente a(2,4): Termo independente b(2): Coeficiente a(3,3): Coeficiente a(3,4): Termo independente b(3): Coeficiente a(4,4): Termo independente b(4): O vetor solucao é: 
: x_1 = 0.999930
: x_2 = 0.999760
: x_3 = 1.000250
: x_4 = 1.000200
